<a href="https://colab.research.google.com/github/kanchan745/advanced-pandas/blob/main/Advanced_Pandas_Data_Modification_and_Cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Modification of data in pandas adding column , update and remove

In [ ]:
import pandas as pd
data = {
    "Name": ['Ram','Shyam','Ghanshyam','Rajat','Raj','Kanchan','Kavya'],
    "Age" :[21,34,24,36,25,21,24],
    "Salary":[50000,62000,85000,500000,85000,850000,6200000],
    "Performance_Score":[85,90,70,50,96,75,85]
}
df = pd.DataFrame(data)
print(df)

        Name  Age   Salary  Performance_Score
0        Ram   21    50000                 85
1      Shyam   34    62000                 90
2  Ghanshyam   24    85000                 70
3      Rajat   36    50000                 50
4        Raj   25    85000                 96
5    Kanchan   21   850000                 75
6      Kavya   24  6200000                 85

In [ ]:
#for assigning newdata in datasets
#square brackets df["Column_Name"] = some_Data(list , series,calculation)
#passing equation

df["Bonus"] = df["Salary"] * 0.1
print(df)

        Name  Age   Salary  Performance_Score     Bonus
0        Ram   21    50000                 85    5000.0
1      Shyam   34    62000                 90    6200.0
2  Ghanshyam   24    85000                 70    8500.0
3      Rajat   36    50000                 50    5000.0
4        Raj   25    85000                 96    8500.0
5    Kanchan   21   850000                 75   85000.0
6      Kavya   24  6200000                 85  620000.0

In [ ]:
#second method : using insert[] method: we can insert a new column at a particular position
df.insert(0,"Employee ID",[10,20,30,40,50,60,70])
print(df)

   Employee ID       Name  Age   Salary  Performance_Score     Bonus
0           10        Ram   21    50000                 85    5000.0
1           20      Shyam   34    62000                 90    6200.0
2           30  Ghanshyam   24    85000                 70    8500.0
3           40      Rajat   36    50000                 50    5000.0
4           50        Raj   25    85000                 96    8500.0
5           60    Kanchan   21   850000                 75   85000.0
6           70      Kavya   24  6200000                 85  620000.0

In [ ]:
#Updating values
#.loc [] it is a method in pandas  we can access a specific cell and can modify
#we can access cell , column ,set of rows
#SYNTAX df.loc[row_index,"column name"]= new value
#row_index - which have to modifiy


#updating Ram value
df.loc[0,'Salary'] = 55000
print(df)

   Employee ID       Name  Age   Salary  Performance_Score     Bonus
0           10        Ram   21    55000                 85    5000.0
1           20      Shyam   34    62000                 90    6200.0
2           30  Ghanshyam   24    85000                 70    8500.0
3           40      Rajat   36    50000                 50    5000.0
4           50        Raj   25    85000                 96    8500.0
5           60    Kanchan   21   850000                 75   85000.0
6           70      Kavya   24  6200000                 85  620000.0

In [ ]:
#Updating all values of Salary

#Increasing salary by 5%
df["Salary"] = df["Salary"] * 1.05
print(df)
#

   Employee ID       Name  Age     Salary  Performance_Score     Bonus
0           10        Ram   21    57750.0                 85    5000.0
1           20      Shyam   34    65100.0                 90    6200.0
2           30  Ghanshyam   24    89250.0                 70    8500.0
3           40      Rajat   36    52500.0                 50    5000.0
4           50        Raj   25    89250.0                 96    8500.0
5           60    Kanchan   21   892500.0                 75   85000.0
6           70      Kavya   24  6510000.0                 85  620000.0

In [ ]:
#REMOVING COLUMNS : KEEPS YOUR DATA CLEAN AND FOCUSED
# USE DROP METHOD  : WE CAN DELETE ANY COLUMN AND ROY USING DROP METHOD IN ANY DATA FRAME
#SYNTAX : df.drop(columns = ["ColumnName"], inplace = True)
#column name which we want to remove or inplace means itll not modify the data directly (no new data frame ) it ll modify in that data

df.drop(columns = ["Bonus"], inplace = True)
print(df)

   Employee ID       Name  Age     Salary  Performance_Score
0           10        Ram   21    57750.0                 85
1           20      Shyam   34    65100.0                 90
2           30  Ghanshyam   24    89250.0                 70
3           40      Rajat   36    52500.0                 50
4           50        Raj   25    89250.0                 96
5           60    Kanchan   21   892500.0                 75
6           70      Kavya   24  6510000.0                 85

**for removing multiple columns**

In [ ]:
df.drop(columns = ["Performance_Score", "Age"] , inplace = True)
print(df )

   Employee ID       Name     Salary
0           10        Ram    57750.0
1           20      Shyam    65100.0
2           30  Ghanshyam    89250.0
3           40      Rajat    52500.0
4           50        Raj    89250.0
5           60    Kanchan   892500.0
6           70      Kavya  6510000.0

inplace = True (to modify the originaldata )

Adding Columns Two ways  : directly using assignment , 2.) using insert method

To update values : .loc[] method  and for bulk updation we can combine condition

To remove column : we can use drop method , always place inplace = True
or if multiple columns to remove so (we use , )and column name

#To Handle ,Missing Data in Pandas

Data cleaning -> process to clean the data
missing values fixing and all
represent by NAN (not a number )
None for object data types
pandas treats data as nan

In [ ]:
#isnull is a method - return booleandata frame

#True = NaN is missing
#False = Value is present
print (df.isnull())


#one more method to know the how many no's are missing
print(df.isnull().sum())

   Employee ID   Name  Salary
0        False  False   False
1        False  False   False
2        False  False   False
3        False  False   False
4        False  False   False
5        False  False   False
6        False  False   False
Employee ID    0
Name           0
Salary         0
dtype: int64

dropna() : we can remove or get a value of dataset or where data is mising

In [ ]:
import pandas as pd
Data = {
    "Name": ['Ram','Shyam','Ghanshyam','Rajat','Raj','Kanchan','Kavya'],
    "Age" :[21,None,24,36,25,21,24],
    "Salary":[50000,62000,85000,500000,None,850000,6200000],
    "Performance_Score":[85,90,70,None,96,75,85]
}
df = pd.DataFrame(Data)

df.dropna(axis = 0, inplace = True)
print(df)

# 0 for rows and 1 for columns

        Name   Age     Salary  Performance_Score
0        Ram  21.0    50000.0               85.0
2  Ghanshyam  24.0    85000.0               70.0
5    Kanchan  21.0   850000.0               75.0
6      Kavya  24.0  6200000.0               85.0

#Remove and Filling

In [2]:
# for filling value

#fillna() -> method
#fillna(value,inplace = True)
import pandas as pd
Data = {
    "Name": ['Ram','Shyam','Ghanshyam','Rajat','Raj','Kanchan','Kavya'],
    "Age" :[21,None,24,36,25,21,24],
    "Salary":[50000,62000,85000,500000,None,850000,6200000],
    "Performance_Score":[85,90,70,None,96,75,85]
}
df = pd.DataFrame(Data)

df.fillna(value = 0, inplace = True)
print(df)

        Name   Age     Salary  Performance_Score
0        Ram  21.0    50000.0               85.0
1      Shyam   0.0    62000.0               90.0
2  Ghanshyam  24.0    85000.0               70.0
3      Rajat  36.0   500000.0                0.0
4        Raj  25.0        0.0               96.0
5    Kanchan  21.0   850000.0               75.0
6      Kavya  24.0  6200000.0               85.0

In [7]:
#we can also use calculated values
import pandas as pd
Data = {
    "Name": ['Ram','Shyam','Ghanshyam','Rajat','Raj','Kanchan','Kavya'],
    "Age" :[21,None,24,36,25,21,24],
    "Salary":[50000,62000,85000,500000,None,850000,6200000],
    "Performance_Score":[85,90,70,None,96,75,85]
}
df['Age'].fillna(df['Age'].mean(), inplace = True)
print(df)
df['Salary'].fillna(df['Salary'].mean(), inplace = True)
print(df)

        Name        Age        Salary  Performance_Score
0        Ram  21.000000  5.000000e+04               85.0
1      Shyam  25.166667  6.200000e+04               90.0
2  Ghanshyam  24.000000  8.500000e+04               70.0
3      Rajat  36.000000  5.000000e+05                NaN
4        Raj  25.000000  1.291167e+06               96.0
5    Kanchan  21.000000  8.500000e+05               75.0
6      Kavya  24.000000  6.200000e+06               85.0
        Name        Age        Salary  Performance_Score
0        Ram  21.000000  5.000000e+04               85.0
1      Shyam  25.166667  6.200000e+04               90.0
2  Ghanshyam  24.000000  8.500000e+04               70.0
3      Rajat  36.000000  5.000000e+05                NaN
4        Raj  25.000000  1.291167e+06               96.0
5    Kanchan  21.000000  8.500000e+05               75.0
6      Kavya  24.000000  6.200000e+06               85.0

/tmp/ipython-input-586067904.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace = True)
/tmp/ipython-input-586067904.py:11: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace = True)

#Interpollation : follows existing patterns for the fillup of missing values
it finds estimates in missing values in a numerical column
#methods-> linear,polynomial
why use
1) preserve data integrity  = missing values replace with realistic no ,(predict real no.)
2)smooth trends
3)avoid data loss
#interpolate()
# is a method with the help of we can fill missing values in any column and in any dataframe
it finds estimate on the basis of other points which are close

In [11]:
import pandas as pd
data = {
    "Time" : [1,2,3,4,5],
    "Value" : [10,15,None,20,25]
}
df = pd.DataFrame(data)
print('Before Interpolation')
print(df)
df['Value'].interpolate(method = 'linear', inplace = True)
print('After Interpolation')
print(df)

Before Interpolation
   Time  Value
0     1   10.0
1     2   15.0
2     3    NaN
3     4   20.0
4     5   25.0
After Interpolation
   Time  Value
0     1   10.0
1     2   15.0
2     3   17.5
3     4   20.0
4     5   25.0

/tmp/ipython-input-2600503088.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Value'].interpolate(method = 'linear', inplace = True)

when to use
1) when we re working with time series dat
2)numeric data with trends
3) avoid dropping rows